## [terraform-project](https://my-first-env.app.spacelift.io/stack/terraform-project/run/01GYW9HGDJM71E3K5MV9VYHWJZ) plan logs

<details>
<summary>Click here to expand</summary>

```
[01GYVZXSYZNVZ3JJGZKZMDBK4F] Planning changes with 2 custom hooks...
Success! The configuration is valid.

spacelift_policy.check-instance-type: Refreshing state... [id=lets-make-sure-the-instance-type-is-t2-micro]
spacelift_policy.trigger-run-from-pr: Refreshing state... [id=trigger-run-from-pr]
data.aws_ami.dev_server_ami: Reading...
aws_vpc.dev_vpc: Refreshing state... [id=vpc-034468bc39f7ddcd5]
aws_key_pair.jubran_auth: Refreshing state... [id=jubran_key]
data.aws_ami.dev_server_ami: Read complete after 0s [id=ami-091b1c4aa02ba6400]
aws_security_group.dev_sg: Refreshing state... [id=sg-051cf6fc0a425966c]
aws_internet_gateway.dev_internet_gateway: Refreshing state... [id=igw-0a380676c773dc530]
aws_route_table.dev_public_rt: Refreshing state... [id=rtb-04185acaf2de0ac35]
aws_subnet.dev_public_subnet: Refreshing state... [id=subnet-06be3e490ade28540]
aws_route_table_association.dev_public_assoc: Refreshing state... [id=rtbassoc-0ce9538b93ccdb0ae]
aws_instance.jubran_dev_node: Refreshing state... [id=i-0b04da954917f2042]
aws_route.default_route: Refreshing state... [id=r-rtb-04185acaf2de0ac351080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.jubran_dev_node must be replaced
-/+ resource "aws_instance" "jubran_dev_node" {
      ~ ami                                  = "ami-047aac48e2ffc201f" -> "ami-091b1c4aa02ba6400" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:379163426062:instance/i-0b04da954917f2042" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0b04da954917f2042" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0af789b8e423ae97b" -> (known after apply)
      ~ private_dns                          = "ip-10-0-121-169.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.121.169" -> (known after apply)
      ~ public_dns                           = "ec2-54-91-4-141.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.91.4.141" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "jubran_dev_node"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-078385c61c9dec8ce" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ dev_ip = "54.91.4.141" -> (known after apply)
[01GYVZXSYZNVZ3JJGZKZMDBK4F] Changes are GO
[01GYVZXSYZNVZ3JJGZKZMDBK4F] Uploading the list of managed resources...
[01GYVZXSYZNVZ3JJGZKZMDBK4F] Please be aware that Run changes calculation includes Terraform output changes.
[01GYVZXSYZNVZ3JJGZKZMDBK4F] Resource list upload is GO
[01GYVZXSYZNVZ3JJGZKZMDBK4F] Generating JSON representation of the plan...
[01GYVZXSYZNVZ3JJGZKZMDBK4F] JSON representation is GO
[01GYVZXSYZNVZ3JJGZKZMDBK4F] Loading custom plan policy inputs...
[01GYVZXSYZNVZ3JJGZKZMDBK4F] 0 custom plan policy inputs found
[01GYVZXSYZNVZ3JJGZKZMDBK4F] Evaluated 1 plan policy
[01GYVZXSYZNVZ3JJGZKZMDBK4F] Plan checks are GO
```

</details>